Revit 2027 API
SolidOptions.GraphicsStyleId Property
 Defines the graphics style id for the Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GraphicsStyleId { get; set; }
Public Property GraphicsStyleId As ElementId
	Get
	Set
public:
property ElementId^ GraphicsStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member GraphicsStyleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SolidOptions Class
Autodesk.Revit.DB Namespace